# Ex1 - Getting and knowing your Data

In [2]:
#Step 1. Go to https://www.kaggle.com/openfoodfacts/world-food-facts/data

In [3]:
#Step 2. Download the dataset to your computer and unzip it.

In [4]:
import pandas as pd
import numpy as np

In [5]:
import pandas as pd

# File path
file_path = r'C:\Users\Dell\Desktop\ArewaDS Workshop\pandas_exercises\01_Getting_&_Knowing_Your_Data\World Food Facts\en.openfoodfacts.org.products.tsv'

# Read the TSV file into a DataFrame
food = pd.read_csv(file_path, sep='\t')

# Display the first few rows of the DataFrame
print(food.head())

C:\Users\Dell\AppData\Local\Temp\ipykernel_20200\2842548256.py:7: DtypeWarning: Columns (0,3,5,19,20,24,25,26,27,28,36,37,38,39,48) have mixed types. Specify dtype option on import or set low_memory=False.
  food = pd.read_csv(file_path, sep='\t')

    code                                                url  \
0   3087  http://world-en.openfoodfacts.org/product/0000...
1   4530  http://world-en.openfoodfacts.org/product/0000...
2   4559  http://world-en.openfoodfacts.org/product/0000...
3  16087  http://world-en.openfoodfacts.org/product/0000...
4  16094  http://world-en.openfoodfacts.org/product/0000...

                      creator   created_t      created_datetime  \
0  openfoodfacts-contributors  1474103866  2016-09-17T09:17:46Z
1             usda-ndb-import  1489069957  2017-03-09T14:32:37Z
2             usda-ndb-import  1489069957  2017-03-09T14:32:37Z
3             usda-ndb-import  1489055731  2017-03-09T10:35:31Z
4             usda-ndb-import  1489055653  2017-03-09T10:34:13Z

  last_modified_t last_modified_datetime                    product_name  \
0      1474103893   2016-09-17T09:18:13Z              Farine de blé noir
1      1489069957   2017-03-09T14:32:37Z  Banana Chips Sweetened (Whole)
2      1489069957   2017-03-09T14:32:37Z                         Peanuts
3      1489055731   2017-03-09T10:35:31Z          Organic Salted Nut Mix
4      1489055653   2017-03-09T10:34:13Z                 Organic Polenta

  generic_name quantity  ... fruits-vegetables-nuts_100g  \
0          NaN      1kg  ...                         NaN
1          NaN      NaN  ...                         NaN
2          NaN      NaN  ...                         NaN
3          NaN      NaN  ...                         NaN
4          NaN      NaN  ...                         NaN

  fruits-vegetables-nuts-estimate_100g collagen-meat-protein-ratio_100g  \
0                                  NaN                              NaN
1                                  NaN                              NaN
2                                  NaN                              NaN
3                                  NaN                              NaN
4                                  NaN                              NaN

  cocoa_100g chlorophyl_100g carbon-footprint_100g nutrition-score-fr_100g  \
0        NaN             NaN                   NaN                     NaN
1        NaN             NaN                   NaN                    14.0
2        NaN             NaN                   NaN                     0.0
3        NaN             NaN                   NaN                    12.0
4        NaN             NaN                   NaN                     NaN

  nutrition-score-uk_100g glycemic-index_100g water-hardness_100g
0                     NaN                 NaN                 NaN
1                    14.0                 NaN                 NaN
2                     0.0                 NaN                 NaN
3                    12.0                 NaN                 NaN
4                     NaN                 NaN                 NaN

[5 rows x 163 columns]

In [6]:
print(food.head())

    code                                                url  \
0   3087  http://world-en.openfoodfacts.org/product/0000...
1   4530  http://world-en.openfoodfacts.org/product/0000...
2   4559  http://world-en.openfoodfacts.org/product/0000...
3  16087  http://world-en.openfoodfacts.org/product/0000...
4  16094  http://world-en.openfoodfacts.org/product/0000...

                      creator   created_t      created_datetime  \
0  openfoodfacts-contributors  1474103866  2016-09-17T09:17:46Z
1             usda-ndb-import  1489069957  2017-03-09T14:32:37Z
2             usda-ndb-import  1489069957  2017-03-09T14:32:37Z
3             usda-ndb-import  1489055731  2017-03-09T10:35:31Z
4             usda-ndb-import  1489055653  2017-03-09T10:34:13Z

  last_modified_t last_modified_datetime                    product_name  \
0      1474103893   2016-09-17T09:18:13Z              Farine de blé noir
1      1489069957   2017-03-09T14:32:37Z  Banana Chips Sweetened (Whole)
2      1489069957   2017-03-09T14:32:37Z                         Peanuts
3      1489055731   2017-03-09T10:35:31Z          Organic Salted Nut Mix
4      1489055653   2017-03-09T10:34:13Z                 Organic Polenta

  generic_name quantity  ... fruits-vegetables-nuts_100g  \
0          NaN      1kg  ...                         NaN
1          NaN      NaN  ...                         NaN
2          NaN      NaN  ...                         NaN
3          NaN      NaN  ...                         NaN
4          NaN      NaN  ...                         NaN

  fruits-vegetables-nuts-estimate_100g collagen-meat-protein-ratio_100g  \
0                                  NaN                              NaN
1                                  NaN                              NaN
2                                  NaN                              NaN
3                                  NaN                              NaN
4                                  NaN                              NaN

  cocoa_100g chlorophyl_100g carbon-footprint_100g nutrition-score-fr_100g  \
0        NaN             NaN                   NaN                     NaN
1        NaN             NaN                   NaN                    14.0
2        NaN             NaN                   NaN                     0.0
3        NaN             NaN                   NaN                    12.0
4        NaN             NaN                   NaN                     NaN

  nutrition-score-uk_100g glycemic-index_100g water-hardness_100g
0                     NaN                 NaN                 NaN
1                    14.0                 NaN                 NaN
2                     0.0                 NaN                 NaN
3                    12.0                 NaN                 NaN
4                     NaN                 NaN                 NaN

[5 rows x 163 columns]

In [7]:
food.head()

,code,url,creator,created_t,created_datetime,last_modified_t,last_modified_datetime,product_name,generic_name,quantity,...,fruits-vegetables-nuts_100g,fruits-vegetables-nuts-estimate_100g,collagen-meat-protein-ratio_100g,cocoa_100g,chlorophyl_100g,carbon-footprint_100g,nutrition-score-fr_100g,nutrition-score-uk_100g,glycemic-index_100g,water-hardness_100g
0,3087,http://world-en.openfoodfacts.org/product/0000...,openfoodfacts-contributors,1474103866,2016-09-17T09:17:46Z,1474103893,2016-09-17T09:18:13Z,Farine de blé noir,NaN,1kg,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,4530,http://world-en.openfoodfacts.org/product/0000...,usda-ndb-import,1489069957,2017-03-09T14:32:37Z,1489069957,2017-03-09T14:32:37Z,Banana Chips Sweetened (Whole),NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,14.0,14.0,NaN,NaN
2,4559,http://world-en.openfoodfacts.org/product/0000...,usda-ndb-import,1489069957,2017-03-09T14:32:37Z,1489069957,2017-03-09T14:32:37Z,Peanuts,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN
3,16087,http://world-en.openfoodfacts.org/product/0000...,usda-ndb-import,1489055731,2017-03-09T10:35:31Z,1489055731,2017-03-09T10:35:31Z,Organic Salted Nut Mix,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,12.0,NaN,NaN
4,16094,http://world-en.openfoodfacts.org/product/0000...,usda-ndb-import,1489055653,2017-03-09T10:34:13Z,1489055653,2017-03-09T10:34:13Z,Organic Polenta,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
# Get the number of observations (rows) in the dataset
num_observations = food.shape[0]
print("Number of observations in the dataset:", num_observations)

Number of observations in the dataset: 356027

In [9]:
# Get the number of columns in the dataset
num_columns = food.shape[1]
print("Number of columns in the dataset:", num_columns)

Number of columns in the dataset: 163

In [10]:
# Print the names of all columns
print(food.columns)

Index(['code', 'url', 'creator', 'created_t', 'created_datetime',
       'last_modified_t', 'last_modified_datetime', 'product_name',
       'generic_name', 'quantity',
       ...
       'fruits-vegetables-nuts_100g', 'fruits-vegetables-nuts-estimate_100g',
       'collagen-meat-protein-ratio_100g', 'cocoa_100g', 'chlorophyl_100g',
       'carbon-footprint_100g', 'nutrition-score-fr_100g',
       'nutrition-score-uk_100g', 'glycemic-index_100g',
       'water-hardness_100g'],
      dtype='object', length=163)

In [11]:
food.columns

Index(['code', 'url', 'creator', 'created_t', 'created_datetime',
       'last_modified_t', 'last_modified_datetime', 'product_name',
       'generic_name', 'quantity',
       ...
       'fruits-vegetables-nuts_100g', 'fruits-vegetables-nuts-estimate_100g',
       'collagen-meat-protein-ratio_100g', 'cocoa_100g', 'chlorophyl_100g',
       'carbon-footprint_100g', 'nutrition-score-fr_100g',
       'nutrition-score-uk_100g', 'glycemic-index_100g',
       'water-hardness_100g'],
      dtype='object', length=163)

In [12]:
# Retrieve the name of the 105th column
column_105_name = food.columns[104]
print(column_105_name)

-glucose_100g

In [20]:
# Retrieve the type of observations in the 105th column
column_105_type = food.iloc[:, 104].dtype
print(column_105_type)

float64

In [21]:
# Check the index of the DataFrame
data_index = food.index
print(data_index)

RangeIndex(start=0, stop=356027, step=1)

In [22]:
# Get the product name of the 19th observation
product_name_19th = food.at[18, 'product_name']
print(product_name_19th)

Lotus Organic Brown Jasmine Rice

# Ex2 - Getting and Knowing your Data

In [23]:
#Step 1. Import the necessary libraries
import pandas as pd
import numpy as np
import requests

In [24]:
#Step 2. Import the dataset from this address.
#https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv

url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv"
chipotle_data = pd.read_csv(url, sep='\t')

In [25]:
#Step 3. Assign it to a variable called chipo.
chipo = pd.read_csv(url, sep='\t')

In [26]:
#Step 4. See the first 10 entries
chipo.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [27]:
#Step 5. What is the number of observations in the dataset?
num_observations = chipo.shape[0]
print("Number of observations:", num_observations)

Number of observations: 4622

In [28]:
#Step 6. What is the number of columns in the dataset?
num_columns = chipo.shape[1]
print("Number of columns:", num_columns)

Number of columns: 5

In [29]:
#Step 7. Print the name of all the columns.
print("Column names:")
print(chipo.columns.tolist())

Column names:
['order_id', 'quantity', 'item_name', 'choice_description', 'item_price']

In [30]:
#Step 8. How is the dataset indexed?
print("Index type:")
print(chipo.index)

Index type:
RangeIndex(start=0, stop=4622, step=1)

In [31]:
#Step 9. Which was the most-ordered item?
most_ordered_item = chipo.groupby('item_name').quantity.sum().sort_values(ascending=False).head(1)
print("Most-ordered item:")
print(most_ordered_item)

Most-ordered item:
item_name
Chicken Bowl    761
Name: quantity, dtype: int64

In [32]:
#Step 10. For the most-ordered item, how many items were ordered?
most_ordered_item_quantity = most_ordered_item.values[0]
print("Number of items ordered for the most-ordered item:", most_ordered_item_quantity)

Number of items ordered for the most-ordered item: 761

In [33]:
#Step 11. What was the most ordered item in the choice_description column?
most_ordered_choice = chipo['choice_description'].value_counts().idxmax()
print("Most ordered item in the choice_description column:", most_ordered_choice)

Most ordered item in the choice_description column: [Diet Coke]

In [34]:
#Step 12. How many items were orderd in total?
total_items_ordered = chipo['quantity'].sum()
print("Total number of items ordered:", total_items_ordered)

Total number of items ordered: 4972

In [ ]:
#Step 13. Turn the item price into a float

In [35]:
#Step 13.a. Check the item price type
print(chipo['item_price'].dtype)

object

In [39]:
#Step 13.b. Create a lambda function and change the type of item price
# Define a lambda function to convert the item_price to float
# Step 13.b. Create a lambda function and change the type of item price
# Define a lambda function to convert the item_price to float
convert_to_float = lambda x: float(x[1:])  # Assuming the item price is in the format '$X.XX'
convert_to_float

In [40]:
#Step 13.c. Check the item price type
# Step 13.c. Check the item price type
print(chipo['item_price'].dtype)

float64

In [41]:
#Step 14. How much was the revenue for the period in the dataset?
# Step 14. Calculate the revenue for the period in the dataset
chipo['revenue'] = chipo['quantity'] * chipo['item_price']
total_revenue = chipo['revenue'].sum()
print("Total revenue for the period:", total_revenue)

Total revenue for the period: 39237.02

In [42]:
#Step 15. How many orders were made in the period?
# Step 15. Count the number of orders made in the period
num_orders = chipo['order_id'].nunique()
print("Number of orders made in the period:", num_orders)

Number of orders made in the period: 1834

In [43]:
#Step 16. What is the average revenue amount per order?
# Step 16. Calculate the average revenue amount per order
average_revenue_per_order = total_revenue / num_orders
print("Average revenue amount per order:", average_revenue_per_order)

Average revenue amount per order: 21.39423118865867

In [44]:
#Step 17. How many different items are sold?
# Step 17. Calculate the number of different items sold
num_different_items = chipo['item_name'].nunique()
print("Number of different items sold:", num_different_items)

Number of different items sold: 50

# Ex3 - Getting and Knowing your Data

In [45]:
#Step 1. Import the necessary libraries
import pandas as pd

In [48]:
#Step 2. Import the dataset 

# Import the dataset from the provided address
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"
user_data = pd.read_csv(url, delimiter='|')

# Display the first few rows of the dataset
print(user_data.head())

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [49]:
user_data.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [50]:
#Step 3. Assign it to a variable called users and use the 'user_id' as index¶



# Import the dataset from the provided address
users = pd.read_csv(url, delimiter='|')

# Set the 'user_id' column as the index
users = users.set_index('user_id')

# Display the first few rows of the dataset with the 'user_id' as index
print(users.head())

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [51]:
#Step 4. See the first 25 entries
users.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

In [52]:
#Step 5. See the last 10 entries
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [53]:
#Step 6. What is the number of observations in the dataset?
num_observations = users.shape[0]
print("Number of observations in the dataset:", num_observations)

Number of observations in the dataset: 943

In [54]:
#Step 7. What is the number of columns in the dataset?
num_columns = users.shape[1]
print("Number of columns in the dataset:", num_columns)

Number of columns in the dataset: 4

In [55]:
#Step 8. Print the name of all the columns.
print("Name of all columns:", users.columns.tolist())

Name of all columns: ['age', 'gender', 'occupation', 'zip_code']

In [56]:
#Step 9. How is the dataset indexed?
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [57]:
#Step 10. What is the data type of each column?
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [58]:
#Step 11. Print only the occupation column
print(users['occupation'])

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [59]:
users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [60]:
#Step 12. How many different occupations are in this dataset?
num_occupations = users['occupation'].nunique()
print("Number of different occupations:", num_occupations)

Number of different occupations: 21

In [61]:
#Step 13. What is the most frequent occupation?
most_frequent_occupation = users['occupation'].value_counts().idxmax()
print("Most frequent occupation:", most_frequent_occupation)

Most frequent occupation: student

In [62]:
#Step 14. Summarize the DataFrame.
summary = users.describe()
print(summary)

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [63]:
summary

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [64]:
#Step 15. Summarize all the columns
summary_all_columns = users.info()
print(summary_all_columns)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB
None

In [67]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [68]:
#Step 16. Summarize only the occupation column
occupation_summary = users['occupation'].value_counts()
print(occupation_summary)

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [69]:
users['occupation'].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [70]:
#Step 17. What is the mean age of users?
mean_age = users['age'].mean()
print("Mean age of users:", mean_age)

Mean age of users: 34.05196182396607

In [71]:
#Step 18. What is the age with least occurrence?
age_counts = users['age'].value_counts()
min_occurrence_age = age_counts.idxmin()
print("Age with least occurrence:", min_occurrence_age)

Age with least occurrence: 7